{"cells":[{"cell_type":"markdown","metadata":{},"source":["Группа DS03-onl\n","Студент Парфимович Алексей\n","Домашнее задание №2"]},{"cell_type":"markdown","metadata":{},"source":["Задача №1.\t\n","Напишите программу, которая рассчитывает расход топлива маршрута.\n","На вход подается длина маршрута и расход топлива на 100 километров. \n","Используйте try catch (проверка что пользователь ввел число>0). "]},{"cell_type":"code","execution_count":11,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Расчет расхода топлива транспортным средством (ТС) на маршрут\n","Введите протяженность маршрута ТС, км:\n","Введите средний расход ТС на 100 км пути, литров:\n","Расход топлива на 5.0 км составит 0.250 л, при среднем расходе 5.0 л/100км.\n"]}],"source":["print('Расчет расхода топлива транспортным средством (ТС) на маршрут')\n","try:\n","    print('Введите протяженность маршрута ТС, км:')\n","    path_length = float(input())\n","    assert path_length > 0, \"Протяженность маршрута должна быть больше 0\"\n","\n","    print('Введите средний расход ТС на 100 км пути, литров:')\n","    avg_consumption = float(input())\n","    assert avg_consumption > 0, \"Расход топлива должен быть больше 0\"\n","\n","    path_cosumption = path_length * avg_consumption / 100\n","\n","    print(f\"Расход топлива на {path_length} км составит {path_cosumption:.3f} л, при среднем расходе {avg_consumption} л/100км.\")\n","except ValueError as e:\n","    print('Ведено нечисловое значение:', e)\n","except AssertionError as e:\n","    print('Ведено некорректное значение:', e)"]},{"cell_type":"markdown","metadata":{},"source":["Задача №2.\n","Напишите программу, которая ищет корни квадратного уравнения вида a*x^2+b*x+c. \n","На вход программы подаются a,b,c. Результатом работы программы – действительные корни или сообщение что корней нет. "]},{"cell_type":"code","execution_count":1,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Нахождение действительных корней квадратного уравнения вида a*x^2 + b*x + c = 0\n","Ведите через пробел значения коэффициентов a, b и c :\n","Дискриминант = 2.8\n","Уравнение имеет два корня:\n","x1 = -1.6333997346592444\n","x2 = -18.366600265340754\n"]}],"source":["print('Нахождение действительных корней квадратного уравнения вида a*x^2 + b*x + c = 0')\n","try:\n","    print('Ведите через пробел значения коэффициентов a, b и c :')\n","    a, b, c = map(float, input().split())\n","\n","    if a == 0 or b == 0:\n","        print('Один из коэффициентов равен 0. Квадратное уравнение неполное.')\n","        if a == 0 and b == 0:\n","            print('Корней нет')\n","        elif a == 0 and b != 0:\n","            print(f'x = {-c / b}')\n","        else:\n","            x2 = -c / a\n","            if x2 < 0:\n","                print('Корней нет')\n","            else:\n","                print(f'x = {x2 ** 0.5}')\n","    else:\n","        discr = b ** 2 - 4 * a * c\n","        print(f'Дискриминант = {discr}')\n","\n","        if discr < 0:\n","            print('Корней нет')\n","        elif discr == 0:\n","            print('Уравнение имеет один корень:')\n","            print(f'x = {-b / (2 * a)}')\n","        else:\n","            print('Уравнение имеет два корня:')\n","            print(f'x1 = {(-b + discr ** 0.5) / (2 * a)}')\n","            print(f'x2 = {(-b - discr ** 0.5) / (2 * a)}')\n","\n","except ValueError as e:\n","    print('Ведено нечисловое значение:', e)"]},{"cell_type":"markdown","metadata":{},"source":["Задача №3\n","Напишите программу, находящую наибольшее и наименьшее значение функции y = -26*x^2+25*x-9 на отрезке [-5,5]. \n","Для решения используйте while и произвольный шаг (например 0.1). "]},{"cell_type":"code","execution_count":5,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Нахождение наибольшего и наименьшего значений функции вида \"y = -26*x^2+25*x-9\" на заданном интервале значений аргумента\n","Ведите через пробел начальное, конечное значения и шаг дискретизации аргумента функции:\n","Функция принимает минимальное значение y = -257503.825 для аргумента x = 99.999\n","Функция принимает максимальное значение y = -10.000 для аргумента x = 1.000\n"]}],"source":["def get_function_value(arg):\n","    return -26 * arg**2 + 25 * arg - 9\n","\n","print('Нахождение наибольшего и наименьшего значений функции вида \"y = -26*x^2+25*x-9\" на заданном интервале значений аргумента')\n","try:\n","    print('Ведите через пробел начальное, конечное значения и шаг дискретизации аргумента функции:')\n","    x_init, x_final, sampl_step = map(float, input().split())\n","\n","    assert x_init < x_final, \"начальное значение меньше конечного\"\n","\n","    assert x_final - x_init > sampl_step, \"шаг дискретизации слишком большой\"\n","\n","    x = x_min = x_max = x_init\n","    y_min = y_max = get_function_value(x)\n","\n","    while x <= x_final:\n","        y = get_function_value(x)\n","        if y < y_min: \n","            y_min = y\n","            x_min = x\n","        elif y > y_max: \n","            y_max = y\n","            x_max = x\n","        x += sampl_step\n","    \n","    print(f'Функция принимает минимальное значение y = {y_min:.3f} для аргумента x = {x_min:.3f}')\n","    print(f'Функция принимает максимальное значение y = {y_max:.3f} для аргумента x = {x_max:.3f}')\n","\n","except ValueError as e:\n","    print('Ведено нечисловое значение:', e)\n","except AssertionError as e:\n","    print('Ведены некорректные значения интервала:', e)\n"]}],"metadata":{"kernelspec":{"display_name":"Python 3.9.7 64-bit","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.7"},"orig_nbformat":4,"vscode":{"interpreter":{"hash":"cf92aa13fedf815d5c8dd192b8d835913fde3e8bc926b2a0ad6cc74ef2ba3ca2"}}},"nbformat":4,"nbformat_minor":2}
